{
  "name": "Rasskan Alrol",
  "race": "Chromatic Dragonborn - Red Ancestry",
  "class": "Sorcerer - Shadow Magic",
  "age": 27,
  "height": "5.5'",
  "build": "Medium",
  "skin": "Red and Scaly",
  "eyes": "Red",
  "hair": "None",
  "facialHair": "None",
  "tattoos": "None",
  "piercings": "None",
  "spellcastingFocus": "Bloodwell Vial +1",
  "weaponOfChoice": "Quarterstaff",
  "greatestFear": "Sheep - It's not crippling but I do everything I can to avoid them. Urge to kill on spot (Like most people with spiders)",
  "mentor": "Draagar",
  "backStory": [
    "Growing up, I had a unique connection to magic that I couldn't quite explain. From very young, strange things would happen to me. Once, I opened a door and when I went through, it put me back in the same room I just left. The first few times things like this happened, I chocked it up to confusion and moved on but when some more obvious things happened, I began to understand that I had a strange connection to magic that I could only dream of understanding. As I grew older, I started to gain more control over this connection. It was like I was developing a relationship with it. Magic eventually became so natural to me, like it was a part of me.",
    "Around 15 years old, I became very interested in books. I thought about the great Wizards of the area and all of the studying that they'd do and I thought that would be the key to understanding more about magic and would make me stronger. Little did I know, it was doing the exact opposite.",
    "During my studies, I began to learn new spells but it was becoming increasingly more difficult to do them. Even the ones that I'd been casting for years started behaving different. This was incredibly frustrating to me so I delved deeper into the books hoping that they would be the cure to what was going on with me. I spent nearly every day at the [Texts Ad Infinium] going over every text that I could find on spells. I was focusing on new spells but was getting nowhere with them. This became my crutch.",
    "After about a year of this, I began to give up and decided that magic might not be my calling. I began drifting toward different kinds of books, still with a focus on magic. Magic was all I really studied this point. After I stopped studying spells, my magical abilities starting coming back. I unconsciously began using my magic as a part of my everyday life again. It was so natural that I didn't notice it at all.",
    "One day, while studying at [Texts Ad Infinium], I came across a few books that mentioned rumors of a secret magical school called Urekonia. After that, I became obsessed with finding out more about it. I began scouring texts and asking around to see if anyone knew anything. No one thought it was real. I thought that this school could help my unlock my potential and teach me how to grow more powerful. After asking around, the school took notice of me. They kept watch from a few to determine how much of a threat to their secrecy I was. I began being more brazen about my information gathering and they didn't like that. Urekonia made a decision to capture me before I could do any damage to their secret nature.",
    "During my capture, I began using magic the best that I'd ever used it. It all came so natural when I was acting out of instinct instead of trying to use my intellect. I'd developed a strong bond with magic that made it difficult for them to capture me. This, of course, lasted about 30 seconds but it felt like an eternity for me. During this fight, they saw what great potential I had with my magical talent. After some deliberation, they decided that the best way to keep me quiet was to take me in and train me. This would satisfy my need for more knowledge and allow them to breed another skilled sorcerer.",
    "Classes were everything that I hoped they'd be. My first few classes were about the differences in magic wielding beings. This made me understand why magic was so difficult for me coming out of a book but so easy when I stopped thinking about it during a fight. My connection to magic isn't based out of my intellect but a bond that I've formed with the weave. I picked up on spells really quickly when I figured this out. The school was different than any other school I’d heard of. It was more of a full commitment than just a place you went to. I studied all forms of magic to have a basic understanding of the different types of magic but I can’t say that I paid too much attention to this. I was more focused on what would make me stronger and have a deeper connection to the weave.",
    "I was assigned a mentor as was everyone else. He was a Gem Dragon named Draagar. After spending some time training me, he thought that I needed some extra protection. He gifted me with a small power of a Gem Dragon. This proved useful when jumping into combat. It came in handy a few times throughout my training when I bit off a little more than I could chew."
  ],
  "feats": {
    "Gift of the Gem Dragon": "Fun! Also, keeps you alive / +1 to a stat",
    "Elemental Adept": "Fire (Ignore Fire Resistance)"
  },
  "desiredFeats": {
    "Eldritch Adept": "Armor of Shadows (Cast Mage Armor on Self At Will)",
    "Metamagic Adept": "(2 Sorcery Points ONLY spent on Metamagic / 2 Metamagic options)",
    "Fey Touched": "+1 to Mental Stat / Misty Step + 1 other spell (Tasha's Hideous Laughter)",
    "Shadow Touched": "+1 to Mental Stat / Misty Step + 1 other spell (False Life??)",
    "War Caster": "Advantage on Concentration Saving Throws"
  }
}
